{
    "posts": [
        {
            "author": "MessyMetal",
            "created_utc": 1525384719,
            "selftext": "Text below is just another dump of my day and my issues, it feels like my toughs stick better in my memory like this, keeping me more sane. Might do this more often, even if barely a handful of people reads it, it works for myself.\n\nToday was tough, the stacking issues and things going on at the moment is hard to deal with.  Work stress, moving/renovating my new apartment, social anxiety of every event I have with friends,  and last but not least, the loss of a good friend of mine, is keeping my mind more than busy \\(another topic from a while ago\\).\n\nIt's too much at the moment, I'm getting anxiety attacks/panic attacks with everything that happens. I'm pushing myself to do things that are all but healthy in attempt to stop the anxiety eating from me. I had another 15 hour work day today, 8 hours of paid work, 7 hours of working in the house without single break. Breaking myself down for no apparent reason.\n\nI want to finish things, I want to get out of this situations, I want this screams to stop as they are driving me insane, but what I want to most at the moment, is self harm.  The voices in my head keep screaming, and they get louder and louder the more stressed I am.\n\nI don't wan't get back in the self harm addiction, nor \"Once in a while to keep sane\" way of self\\-harming I've been doing for awhile now. I believe its already over a month since the last time, would be a shame to start again.\n\nI see quite a bit of people around here wondering why other people cannot be depressed, I prefer wonder how I get rid of my problems instead of wondering why someone else doesn't have them. Tomorrow back to work, Saturday paint another couple walls. \n\nStay moving people, try something in reach, either if it's climbing a mountain or getting out of bed. Good\\-luck all."
        },
        {
            "author": "Iamnobodi93",
            "created_utc": 1526800125,
            "selftext": "I have some very important exams coming up, and as I was studying yesterday at the library I suddenly started feeling very anxious. \n\nSo I went for a walk outside. But that didn't help much. So I went home and studied.  By time I went to bed the anxiety still didn't go away. \n\nSo unsurprisingly I did not sleep well. I am getting physical, hot sensations since yesterday I was at the library around my body that feel highly uncomfortable. It's still not going away. \n\nI took many supplements to try and ease the anxiety, like L\\-Theanine, Magnesium, Lemon Balm tea, Holy Basil...but it hasn't helped. \n\nAny tips? I just want the sensations to go away..."
        },
        {
            "author": "Izuku_Urameshi",
            "created_utc": 1527711878,
            "selftext": "This is my first post in this sub and I need help.\n\nNow let me explain a bit about myself and why this is causing me grief. I have always been incredibly aloof and oblivious about many things in my life. I am also a dreamy kind of person. All of this adds to a person that really doesn't think so hard on many subjects. I can focus on problem solving and skills but once I'm in a position to not do that, focus goes out the window.\n\nBecause of this I am not a stressed out person. I barely stress about anything as I'm the kind of person that sees \"If it gets done, then its ok.\" I am just a type that goes with the flow. Of course when push comes to shove, I try my best to resolve the situation the best I can.\n\nNow about the anxiety...\n\nIt started with thinking. Yeah, I know right? But everyone thinks about things to come and what to do and this and that. Not me. I don't think if I don't have to but I have been recently. A lot has to deal with physical illness but not of my own. My father and mother in law have both been to the hospital several times this year. My FIL almost died two months ago.\n\nBecause of this my focus has started to bleed into my life. I'm starting to think about the future a lot, having to deal with my FIL maybe passing soon, dealing with the fact my MIL might not be able to watch my kids and then of course it snowballs from there. Stress from my in laws, stress from my work, stress in general like the little things keeps piling and piling up. That I have been able to manage for the most part but there is one time where my anxiety rises to the point of panic attacks.\n\nWhich is my period.\n\nI have three kids. I have suffered a miscarriage in between two and three. Recently, I had to abort one pregnancy. It was an incredibly tough decision. The matter was money. We didn't have enough at the time and my recent child was barely hitting 6 months. We wouldn't be able to take care of this new child, we would garner the hate from my parents and my husband's parents. Logically, all points headed toward, WE CANNOT KEEP IT. So I went through with it. I thought I dealt with it.\n\nNow, whenever my period should be coming, I start to have panic attacks. It starts off slow but builds up the more I think my period is late to the point where I feel like my throat is closing in, I start to hyperventilate and start losing control. I had a panic attack yesterday where my own husband had to give me the 5 points to calm me down. Even now, I still feel the effects of my panic even though I already have my period to the point where all I want to do is scream.\n\nI don't know how to handle this. I don't know how to deal with this. I'm scared of myself and my mind the more I start thinking about the preparations I have to deal with in the future. I'm trying to relax with my hobbies but that time is getting scarcer as my first two kids are going to start school soon so I have to be the teacher for this short moment to prepare them.\n\nIf anyone has any advice at how to deal with anxiety, in a healthy manner, I am all ears.\n\nEdit: I'm sorry to not include this the first time around, my mind is a little jumbled, but the panic comes from the FEAR OF GETTING PREGNANT. That bit of time when my period is 'SUPPOSED' to hit to when it does is when I go to a downward spiral of pure panic. It's what cause my attack yesterday because I thought I MIGHT be pregnant again. Just to clear things up. Otherwise, I'm perfectly well in handling my stress for the most part."
        },
        {
            "author": "slowismore",
            "created_utc": 1527288097,
            "selftext": "Recently social anxiety is making me jealous/ultra depressed in every possible aspect of life.\n\nRecently I tried instagram to help my  \"business\" \\(art and stuff\\) and it's a total mess.\n\nMy friends: finding random online friends on instagram, getting flooded with DMs, getting 1k\\+ followers in like 1 month for only copying memes and uploading some random photos with no effort\n\nMe: spending hours on my art \\+ making own stuff etc, then getting nothing. I used to have some likes now it's 0. This isn't the only time this happened on social media \\(**loss of follower activity \\- this is the main problem/point**\\).\n\nI think it's cuz my SA aka I don't DM anyone cuz idk how \\(altough noone DMs me either\\). I don't advertise myself cuz I'm anxious and feeling weird doing that. And I can't interact with my followers except saying \"thank you\" cuz it's just making me anxious and too much stress in general.\n\nAnd I hate how this has to ruin everything all the time in my life. If I had social skills of my friends \\+ my art then I could be ultra famous but nonoo ofc I just have to get bored to hell at home or stress myself to death outside."
        },
        {
            "author": "axiomaticCJ",
            "created_utc": 1527779646,
            "selftext": "Hey guys,\n\nNew kid on the block just thought i'd share my situation. Watching porn for around 10 years on and off, i watch most days about once a day. Have had a girlfriend for half that time and never had any problems sexually. In the last year been suffering with a bit of ED when i have sex and also when i masterbate and i've finally accepted that this is due to porn. Have tried to quit on and off for the past month but aren't getting very far due to stresses of exams and end of uni work etc. I use porn as a stress relief and definitely watch it every time i am frustrated / depressed. It's just such an easy thing to do when i am sat at my desk doing work for my course, and i always feel guilty afterwards. I thought when I move in with my girlfriend at the end of uni next year i would not watch porn anymore (as currently we are operating a semi-long distance situation with only seeing her once a week) but i'm realising i really do not have control over my watching as much as i thought. Wondering if anyone has had a similar experience to me and what did they do, this is the last part of my life that i need to take control of, as sufferring from an episode of anxiety last year and then treating that by going to the gym has sorted my mental health out its just this addiction to porn that i need to solve now!! "
        },
        {
            "author": "Cheydin56",
            "created_utc": 1525857411,
            "selftext": "After about 3 years of trying to help my bf quit I have started to give up and get angry with him whenever he relapses because it has taken a toll on my self esteem and how I see myself; not good enough or attractive enough. However, me getting angry and throwing it at his face whenever I get the chance won’t make things better. It’s very frustrating that his way of dealing with any stress or even to deal when we get in a small argument is to go to porn. I do admit I make it worse now tho because of the way I get mad about it but I wanna go back to being supportive and motivate him to stop. \nOh and giving him more sex isn’t a way to help because even tho i’ve tried that he sometimes has relapsed after we have because he says it “starts him up” and wants to again but if I can’t be there the next day to he just turns to porn, which truly ruins the day we spent together and just ruins my sex drive in general.\n*To make it more specific the way he ends up relapsing because of stress and being angry and then blaming me for not being there or for making him mad is what really puts me on edge and makes me not want to be supportive. I spend most of my time worrying and trying to help him as much as possible so he won’t get stressed."
        },
        {
            "author": "thepropounder",
            "created_utc": 1527546228,
            "selftext": "Ok so the deal is that I have been doing not so good in my exams and I signed a bet with my roommate that I would pay money for every assignment not delivered (we have many, all aren't mandatory) and those I did not do I payed. Also I had to pay for every flunked exam. This was to keep me focused during the semester. That worked pretty fine in the beginning but ended up taking way too much time and now I have several exams coming up that I am not as prepared for as I could have been because I kept having to deliver in ALL the assignments instead of focusing on learning the course. Keep in mind that we often have access to the solutions so it ended up with me pretty much copying that just to not pay. Pretty stupid, I know.\n\nNow the problem is that I am probably going to fail at least one exam, and according to the deal I will owe my roommate about 500 USD per exam I fail. I set this price so that I would study and not fail but now I'm regretting this terribly. What should I do? He says he wants me to pay but I would not take such an amount t of money from someone just because of a bet. Should I simply refuse?\n\nI have been struggling with this failing exams for quite a many years now and it's pure good old fashioned exam fear and stress. During the exam period I often get really apathic and struggle just reading the textbooks and probably every time I end up struggling to keep a consistent sleep rhythm and my whole life pretty much falls into a heap of just procrastination and worrying. It's a huge problem and during the semester I'm really not like that at all. I am considering going to a psychologist to get some help overcoming this as I am quite close to being cut off the program and thus not getting my degree. That is why I made the bet with my roommate but apparently loosing money is just as ineffective as the fear of failing my exams are at conquering the apathy that grips me every exam period.\n\n"
        },
        {
            "author": "darthdonuts",
            "created_utc": 1525586387,
            "selftext": "This is very hard for me to write out.\nI think I have some sort of anxiety issues. \nI only think of the worst possible outcome in every situation. I can’t help it, I just do.. \nIf my boyfriend is 10 minutes late getting home from work, I freak out. I can’t help but think something is wrong, like he got in a bad wreck or something. If he doesn’t text me back, I freak out even more thinking something is very wrong. I just sit in silence, praying and waiting to hear his truck. It’s probably important to note that when I was 15, my boyfriend at the time passed away in a car accident. So that’s probably why I can’t help but be scared when my now boyfriend is late getting home. But when I am freaking out like that, it’s bad. My stomach is in knots, I can’t eat, sometimes it’s so bad that I throw up. Also, when I get in any kind of argument/fight with him. I’m terrified that every little thing is going to end our relationship, even though in my mind, I know all couples fight sometimes. There’s been two separate times where we went a few days without speaking... I was absolutely crippled during those days. I didn’t eat, I hardly got out of bed, I’d be throwing up.. I just layed there crying, terrified that we were going to break up... it’s bad and I know it’s not normal.. \nWhat’s going on with me? Should I get help? "
        },
        {
            "author": "BorisKay",
            "created_utc": 1525600141,
            "selftext": "I am currently on meds and look for a good therapist. Long story short, I have childhood traumas and have been suffering on and off with depression and anxiety since I was 12-13 (I am 28 now) - like back when I was in seventh grade when I was preparing for the entry-exams for high school I would breakdown and cry everyday, thinking, FEELING THAT IS ALMOST A FACT that I will fail at my exams. Just like that. For no reason. I was the best boy in my class in terms of grades and probably third-forth place in the class. Just because a thought so small can stick inside my head, not leave and stay until it becomes a giant big monster that could eat me from the outside.\n\nI gave this example so you can get the idea of my mind. My grandmother is 74, has some initial stage of vascular dementia, but goes to the park every day, reads books, paints, etc. But I can't help this crazy thoughts that all my efforts to study for a carrier change, go out with friends, find a loving girl, even curing my anxiety - all that is pointless, because death will surely come. My mind tells me this is madness of course, but it FEELS so real and justified. But it is like an avalanche - one thought leads many others with it - because I imagine how I will be beating myself once she is dead for all times in the past when I was younger when I was being rude with her, or being a slacker now due to my anxiety makes me angry and fed up with myself, which means I both lack the motivation to live full time and in the same time I hate being like this hence I can't find relieve neither in being active, nor in being a sloth. And this fear of death goes to my mother too, because we all age, so she will age more as well. And it is a pure egoistic fear, I just panic when I think of the horror I will experience some day and when I think this horror is inevitable, the fact that time flies EVERY DAMN SECOND AND LEADS US CLOSER TO DEATH IS MAKING ME CRAZY! Also (as part of the avalanche of bad thoughts) I do feel bad for acting as one giant p**y and chicken in the face of real life. Lastly, feeling so down and badly, I just feel I will never get on my feet and have a productive nice life and family and nobody wants to be a crazy depressed middle aged maniac with no kids and wife, right?\n\n"
        },
        {
            "author": "Lil_astronaut",
            "created_utc": 1527651031,
            "selftext": "I'll try to be as brief as possible. At 15(21 now) I started smoking weed daily and jerking off while high often. Over the years I've noticed my porn erections were weak. I started no fap and was more or less fixed(had libido shooting through the roof I was annoyed but miss that feeling more than anything in the world). In college I gained weight due to many stressors. I woke up anxious and stressed and drowned myself in weed. I've quit weed but have had many psychological erection issues and feel like my penis has gotten smaller. My nightly erections are stiff but not full. I tried masturbating for the first time in a long time. Didn't use porn just imagination and while it was okay I came quickly and lost the erection many times. After I felt like I had blurry vision and 0 energy. Wasn't even that enjoyable tbh. I do have performance anxiety and normal anxiety. I am no longer as anxious and stressed about other issues but my erection is a main problem and I can't even get it moving with girls(no libido or blood flow). I realized I've been using Instagram a lot which has a lot of sexual stuff so I'm thinking of stopping. My plan is to meditate and exercise more(stress was so extreme at one point it made my body right with horrible blood flow, still recovering). If anyone has any advice i wanna hear it. I feel like I'm losing my will to life which sounds weak but I've been dealing with sexual issues for so long I can't take it anymore I just wanna be happy(not suicidal I'm just giving up and resorting to prescription drugs). Doctor prescribed me viagra(25mg) to take at night for a month but I haven't started yet.  I hate myself for screwing my life over but I just wanna be normal again."
        },
        {
            "author": "HalfTamed",
            "created_utc": 1527616825,
            "selftext": "     I've had depression Anxiety most my Life, and had better periods, followed by worse.   \n\n     I have a history of opioid use, the most recent was buprenorphine. (More than 2 years ago)  haven't used street drugs long time\n\n     The last time I was able to leave the house regularly I was taking Ativan.  I missed therapy (not med) appointments, and was booted from the program.  \n\n     I have never felt like talking about my stressors has helped.  Therapists agree that those things (circumstances) are beyond my control, and are things that would sadden most people, conversation hits a dead end.  But just because something is beyond my control, doesn't mean it doesn't make me unhappy.  Discussing those issues with no advice, and no solutions causes me intense stress, why I miss appointments.\n\n     Is there any point to seeking help?  \n\n     The last treatment I received was a respite visit, ended with a SSRI I hadn't tried with no effect.  The doctor there said that since I had taken so many, there wasn't much he could do (this was Escitalopram Lexapro)  \n\n     I don't tell them that I have one Attempt a year and a half ago that would have killed me, if EMTs haven't rescued me.  I want to be better, not locked up and suicidal.  I've been offered ECT, how tf is that helpful??  Like:  'nothing else works, better electrocute his brain.'  \n\n    I have discussed that with my history this is likely a dopimine problem, which seems beyond their scope of treatment.  They seem to be annoyed by this and I no longer mention it.\n\n     Should I give up?  I'm supposed to be working with these doctors, not arguing my case.  I don't have the energy to disagree with them, it makes me extremely anxious when it seems I'm not being understood, and am already terrified to leave the house.\n\n     I also feel like it's my fault, because so many other people get better on these meds.  And I'm looked at like I should be too, and that my negativity is to blame for the problem.  All I can say is if I am still terrified, and still suicidal, then I am not receiving help.\n\nAlso exercise 5 days a week.\n\nWhat do you do when help doesn't help?"
        },
        {
            "author": "Cacci09",
            "created_utc": 1527108964,
            "selftext": "“Same church, different pew”; that’s how someone very close to me who has overcome drug addiction put it when I told them about my addiction to porn and masturbation. And until I heard that, it hadn’t quite occurred to me that what I and a lot of us are struggling with is, in fact, an addiction. \n\nJust like many of you, I’ve tried quitting before. Sometimes my bouts of “quitting” lasted weeks and sometimes only days. I would get so frustrated that I couldn’t just stick to it and would ultimately return to complacence with my addiction. But when I finally started treating it as an addiction, I found success.\n\nIf you find yourself struggling to quit, the best piece of advice I can give you is to uncover WHY you’re addicted. Similar to recovering alcoholics or drug addicts, porn addicts “use” as a coping mechanism; whether it be to combat anxiety, stress, or purely for escapism, pornography and masturbation have become integrated into your life as a basic need.\n\nFor me, it took therapy to uncover exactly why I became addicted porn. To outline my personal testament, I grew up in an abusive and anxiety / depression inducing household, and I would use pornography and masturbation as both a mental and physical escape. It was a form of self-soothing to cope with the anxieties of my household. \n\nWhat you learn as a child sticks with you for life.\n\nYou see, as a child I conditioned myself. So then as an adult, any time I encountered anxiety or stress (which was multiple times every day), I would return to my age-old habit of coping. It wasn’t until I fully understood WHY I was always watching porn and masturbating that I could come against my addiction with the proper tools and strategies.\n\nIf you’re serious about quitting and turning your life around for the better, I encourage you to take some time and reflect. Try to uncover how your addiction started and what you’re feeling immediately before you’ve given in to your urges. Is it anxiety? Is it loneliness? It is indeed something.\n\nRecommendations:\n\nHere are a few strategies to get you started on the right path\n\nThe list: Make a list of everything you enjoy doing. Some things on my list are playing guitar, exercising, playing (getting my ass handed to me at) Overwatch, and reading. Now keep this list handy, because you are going to reference it every time you have the urge to masturbate or watch porn. This strategy that I learned in therapy is designed to rewire your thought processes and how you handle your triggers. Instead of giving in, pick something, anything from that list and just do it. Over time, that knee jerk reaction to fap will be replaced by a different, healthier coping mechanism.\n\nIdentify your triggers and cut them out: You’ve all probably heard it before: “Thoughts become words, words become actions, actions become habits, and habits become destiny”.\nIdentifying and eliminating your triggers will help you combat your addiction at the first link of that long chain, thoughts. Unfollow any twitter, insta, or even Reddit accounts that triggers you. No matter if it’s a porn account or an attractive person you know, if it’s a trigger, fucking cut it. You’ve made your brain extremely sensitive to image triggers, so cutting these accounts out will reduce your triggers and ultimately aid your fight. Moreover, find someone you can confide in and let them set up a porn blocker on your phone and WiFi that only they know the password too. Stop making excuses, this can only help your efforts.\n\nLastly (for now): Get yourself a copy of an Alcoholics Anonymous, Sex Addicts, or Narcotics Anonymous  book and read that thing from front to back. Addiction is addiction. Take the time to understand what you’re fighting and soak in all the wisdom that will get your life back on track.\n\nConclusion: If you’ve found yourself struggling to quit, do whatever it takes to uncover why. Knowledge is power. When you fully understand WHY, true CHANGE can follow.\n\n\n\n\n\n"
        },
        {
            "author": "HalfTamed",
            "created_utc": 1527615401,
            "selftext": "     I've had depression Anxiety most my Life, and had better periods, followed by worse.   \n\n     I have a history of opioid use, the most recent was buprenorphine. (More than 2 years ago)  haven't used street drugs more than 3-4 1 time slips in over 10.  \n\n     The last time I was able to leave the house regularly I was taking Ativan.  I missed therapy (not med) appointments, and was booted from the program.  \n\n     I have never felt like talking about my stressors has helped.  The therapists agree that those things (triggors) are beyond my control, and are things that would sadden most people, conversation hits a dead end.  But just because something is beyond my control, doesn't mean it doesn't make me unhappy.  Discussing those issues with no advice, and no solutions causes me intense stress, why I miss appointments.\n\n     Is there any point to seeking help?  \n\n     The last treatment I received was a respite visit that ended with a SSRI I hadn't taken that again did nothing.  The doctor there said that since I had taken so many, there wasn't much he could do (this was Escitalopram Lexapro)  \n\n     I don't tell them that I have one Attempt a year and a half ago that would have killed me, if EMTs haven't rescued me.  I want to be better, not locked up and suicidal.  I've been offered ECT, how tf is that helpful??  Like:  'nothing else works, better electrocute his brain.'  \n\n    I have discussed that with my history this is likely a dopimine problem, which seems beyond their scope of treatment.  They seem to be annoyed by this and I no longer mention it.\n\n     Should I give up?  I'm supposed to be working with these doctors, not arguing my case.  I don't have the energy to disagree with them, it makes me extremely anxious when it seems I'm not being understood, and am already terrified to leave the house.\n\n     I also feel like it's my fault, because so many other people get better on these meds.  And I'm looked at like I should be too, and that my negativity is to blame for the problem.  All I can say is if I am still terrified, and still suicidal, then I am not receiving help.\n\nI also exercise 5 days a week.\n\nWhat do you do when help doesn't help?"
        },
        {
            "author": "jusupuffi",
            "created_utc": 1526585588,
            "selftext": "Hello,\n\nI’m a 22-years old male, whos in a bit of a fickle. About a month back, i was finishing my university exchange abroad and getting ready for a trip with a friend of mine and a couple of his friends that i wasn’t acquinted with, from his exchange. Prior to this trip i had, for some reason (final exams, going on a trip with strangers etc) developed a slight anxiety, which i wasn’t able to pinpoint exactly. I was sure that this anxiety would go away when i finished my exams (like my anxiety usually does) but when it didn’t, i felt puzzled and somewhat hopeless (the anxiety made me feel very weak both mentally and physically). Due to this, i was quite nervous for my trip, since i didn’t feel very good and i was supposed to spend a couple of weeks with strangers. In the end, this anxiety resulted in my first panic attack, just when i had landed from my flight to LA, where my friend was meeting me. I spent about three hours in bed that night, feeling the most intense fear, despair and anxiety of my life, recognizing that i was on the other side of the world from my home and that there was no way out. I was only able to calm down after i called my good friend. After this episode, i felt a little jittery for the whole vacation, fearing another panic attack. Luckily, an attack never came. However, after this episode, i’ve had a serious case of derealization. I knew what the feeling was, since this isn’t the first time i’ve suffered from it ( my first, couple of months of duration derealization period was when i was eighteen, which resulted in depression). Since then, i’ve had a couple of longer derealization periods, but they’d all gone away without any professional help. However, this time the derealization seems more depressing and hard than ever. In fact, i’ve crossed a treshold, where i don’t only feel like every moment is a hazy dream, but i’ve actually started to look at humans (my friends for christ sake) as something weird and unrecognizable, like i was another species or something. This is truly fucked up, and since i see people everyday, i can’t escape this horrible feeling. So, my question to you, the good people of reddit, is, how should one proceed? I feel like the more i let myself believe that this feeling is forever and that i live in a weird world filled with people that i can’t recognize, the more i’ll believe it and the harder it’ll be to get normal. Thanks in advance"
        },
        {
            "author": "atimetraveller112358",
            "created_utc": 1526334451,
            "selftext": "Well I'm not new here I made it to 2 months last year after countless attempts then I just couldn't hold a long streak it went from once a week to almost once a day again I just can't I have zero motivation and I can see huge differences from nofap me and the current me I reached a point of less anxiety self control just a overall feeling good I'm sire most of know of the superpowers well they're real and I don't know why my stupid brain tricks me into fapping like hitch I'm doing it for you hahaha I think what kills me the most is not having someone to talk to about this its not something you casually bring up or at least I can't and I don't have that many friends I talked to one friend about it and he said no that he can't live without porn I proposed punching our legs when the other one relapsed he said I'd be breaking his legs all the time and he said it's a normal thing and alot of people say that so I don't know deep down I don't want to but I keep making excuses to fap ☹ especially how I basically don't do much all day I don't even go to the park to jog as often I just can't and if I do I can't jog as much another reason I want nofap , I know what my triggers are and what to avoid but I'm definitely back to square one another big thing that gets me is let's say I'm watching anime and I look up a cosplay of a echhi character and just slowly getting more and more into it and I snap and say hell no but by then my heart is already pounding and I heard or read somewhere that watching porn without masturbation is edging which is worse than just get tu ng it over with so I do that alot of the time but I know deep down its just excuses I make , no matter what the porn isn't acceptable anymore I need neeed! To stop . If anyone can provide me more info on the science behind fantasizing or just advice I feel that will be my hardest part to face I'm not gonna give myself a moment alone in my room I don't trust myself but at least in admitting it in tired of the guilt after every relapse I know I'm not alone if I'm gonna suffer Imma do it for the good long term its time to get back into it but I need someone to talk to or go through this with me to motivate each other please anyone , or advice thanks.. good luck to y'all "
        }
    ]
}