{
    "posts": [
        {
            "author": "tomthefnkid",
            "created_utc": 1525301084,
            "selftext": "I'm 18, male. I suffer from depression and experienced an episode last night which led to a panic attack this morning, and then I suffered from a migraine because of the emotional stress. This is out of the norm for me as I've never been this sensitive before and I've never had a panic attack so bad.\n\nThe migraine has gone down, but I just went to itch my eye and found that it hurts when pressure is applied which is unusual. Just the right eye. Like a dull pain behind my eye ball when light pressure is applied.\n\nI don't know what could cause it or if any of this is related, but my lowkey concern is that maybe something is causing problems back there that might be causing my mental health to have worsened. Maybe I'm just being crazy, but I don't want to ignore it."
        },
        {
            "author": "MegaUltraJesus",
            "created_utc": 1526435727,
            "selftext": "So back during the winter of last year I started to have sharp pains in my chest and didn't get it checked out for like a week before finally realizing it was costochondritis or swelling of the cartilage in the chest which can happen from a number of things. During that time though I had multiple panic attacks and was very stressed. Well just as soon as the pain started to let up and I came more to terms with what was going on I suddenly started having a pressure headache, which ended up lasting for 10 days before going away. This was probably from the stress and my neck muscles tensing up but again this caused a lot of stress as having a 24/7 pressure in your head can really fuck with you.\n\nIt's now been about 3 or 4 months since I've had any actual physical issues but I still have this sort of feeling of being out of it like my perception is off. Now I've heard of derealization/depersonilization but this feeling doesn't really sync up with that cause I still feel like me and I still feel in control and attached to the world. At this point I'm pretty sure it's because of stress and anxiety but I find myself regularly worrying that there's something wrong my brain like a tumor or something and that I'm going to die if I don't get it scanned. I'm going to be starting therapy soon so hopefully they can help me suss this feeling out but I'm just curious if anyone else has experienced anything like this - especially after some sort of medical or emotional trauma that was very stressful. I just want to feel \"normal\" again if that makes sense but part of me wonders if I do feel normal and my brain is just fucking with me."
        },
        {
            "author": "backuppats",
            "created_utc": 1527389719,
            "selftext": "Well I just relapsed again since idk I’m so stressed out rn and I used that to relieve some tension. How do u guys deal with stress other than working out/athletics cuz I already do a lot of that and they only work to calm me down, not de stress me. Honestly not much is going well in life right now which I’m not like depressed about but it does have me stressed. Any help would be appreciated "
        },
        {
            "author": "nevergo_neverknow",
            "created_utc": 1525983354,
            "selftext": "Hello all, \n\nI’m four days in and up to now it was easy. However, today was extremely stressful at work and I had so many cravings and seriously just wanted to go home and smoke a nice fat one. On top of this, Im pretty depressed and don’t even know if i like my job. I didn’t think I would make it through the day without smoking to be honest. \n\nFor me and many stress triggers cravings due to the fact that MJ used to be what cleared our minds of the stress. Our brain created neural pathways from stress and anxiety to MJ resulting in relaxation, and it is a brutal cycle. The mind can be so powerful and a huge bitch and tell you cmon just go home and get high you deserve it. I got on this subreddit to remind myself of how myself and others feel due to this god forsaken plant. \n\nI am now going home to take a personal day WITHOUT smoking. I am just going to read, be outside, be with my dog. I just want for anyone to know that you may not be able to handle what life throws at you, but you damn well can handle how you react to it. We all get stressed, but we cannot let our neural pathways the our MJ addiction created control us. I am beyond proud and admire every person in this community who is fighting to make a better lives for themselves and their families. Let’s keep on and prove the doubters wrong.\n\nCheers friends! "
        },
        {
            "author": "LoneDruid",
            "created_utc": 1526825115,
            "selftext": "Hello guys,\n\nI'm trying to learn programming for a career change in my 29. I have to admit I'm not the sharpest tool in the shed so I get stressed a lot when I don't understand a subject. When I'm stressed I want to cry but as a man I just eat and fap. Due to the these bad habits I gained 35 kg and I fap almost daily.\n\nTwo months ago I decided to lose some weight and put an end to my stress eating disorder. I bought a stress ball and lots of gums. When I get stressed I start chewing gum and toy with my stress ball. Thanks to the ball and gums I lost 10 kg. This method works but I don't want to depend on things to handle my stress. I watch videos on how to handle stress etc. so I can drop those two in future.\n\nAfter successfully handling my stress eating habit this week I started to battle in the fap front. As a fap control I start screen sharing my computer with my family whenever I'm on my computer. So far this shit works like a charm. I know this is not a real self control but we all have to start from somewhere. \n\nIt's not too much but 5 days is better than nothing. I want to end my post with my favourite quote.\n\nWatch your thoughts, they become words; watch your words, they become actions; watch your actions, they become habits; watch your habits, they become character; watch your character, for it becomes your destiny."
        },
        {
            "author": "jellies-and-fruits",
            "created_utc": 1527002400,
            "selftext": "I know it sounds silly but with all the stress and pressure of national exams i'm on the verge of actually climbing onto the parapet and just falling everytime I walk past it after school\n\nExcept I don't have the guts to do it and also it'll suck for the cleaners. I'm just so overwhelmed i've been trying to suffocate myself with the pillow when i sleep so I don't have to wake up and deal with tomorrow.\n\nIf anyone has tips on how to handle stress i'd love them, please :) literally all the methods my school has taught me flew in one ear and out the other and sent me spiralling into a pit of panic and neverending fear. I've been resorting to unconsciously trying to kill myself to get myself out of exams, and I think we both know there's a better way. Please help me."
        },
        {
            "author": "RebootedLife",
            "created_utc": 1527200364,
            "selftext": "I'm really seeing how much of an effect alcohol had on me. Since quitting I have seen a lot of health benefits.\n\nUnfortunately, it seems alcohol was relieving some stress. Now my dentist is saying I have been grinding my teeth and this is a recent issue. They didn't say anything 6 months ago which is just a bit before I quit. I believe it is related.\n\nI have a night guard now and I am trying to relieve stress, but I have to admit... I'm struggling guys/gals. I don't want to drink and I don't want to be stressed out.\n\nAnyone else experience this? I cannot be the only one. What did you do for it?"
        },
        {
            "author": "138lostinspace",
            "created_utc": 1525915262,
            "selftext": "I mean rough days or whatever. Days when you find yourself stressed, sad, angry. Days that you would have most certainly drank before.\n\nI'm not even sure what the deal is today. This is the first rough day I've really had where I feel anything but happy due to not drinking. Crazy thing is that I really haven't had an urge to drink and I know that I'm not going to. I just can't help but  wonder if this is just a normally stressful day or if there's a hole there, because I know in the back of my mind that I would normally be drinking right now.\n\nI suppose I know that this is just what stress and overwhelming feel like when you're not using alcohol as a coping mechanism. I know I need to just feel it and address why I actually feel the things that I do, but damn if that doesn't seem rough when my old way is gone.\n\nThing is, I've had fleeting thoughts lately about what catastrophe will feel like when I am sober. I generally handle stress very well, even outside of drinking. However, anytime it was particularly bad, I would definitely drink. When my dad died last year, I probably drank for two weeks straight. I don't want that to happen again.\n\nI was just wondering what your all's thoughts and experiences on this are."
        },
        {
            "author": "123imedgy",
            "created_utc": 1527541330,
            "selftext": "WARNING!\n\nTHIS SOUNDS LIKE I WANT MEDICAL ADVICE BUT I DON’T. I JUST WANT TO KNOW WHAT TO DO ABOUT MY CONDITION SOCIALLY!\n\n\nMy mom yells at me a lot. Even when I was young. She wasn’t abusive she was just stressed a lot and would often give me many orders at once which would stress me out. Recently when she does this stuff I’ve started having what I thought was panic/anxiety attacks. The same feelings occurred during particularly stressful moments but I thought it was a heart attack or something. I googled symptoms and I match 4/5. I meet all the criteria besides hysteria but I heard you can still have panic/anxiety attack’s without experiencing this symptom. I don’t know how to tell my parents as I visit doctors frequently because to put it frankly. There’s a lot wrong with me. I’m a colour blind asthmatic who used to have eczema and had always had hearing problems. I don’t want to bother them over something that could be nothing."
        },
        {
            "author": "icywnd007",
            "created_utc": 1527321961,
            "selftext": "Life is stressful, and sometimes to relieve the stress if out &amp; about, I'll quip a little with the cashier or do a mini-vent about a good item that went out of stock or whatnot.  Neither takes more than about 30 seconds; a minute if they engage. \n\nBut literally EVERY time, feel I've crossed an invisible line.  The person suddenly recoils, adopts a deadpan expression and is curt throughout the rest of the interaction.  This happens regularly.  \n\nEver feel you are so subhuman that people shun you at the slightest irregularity?\n"
        },
        {
            "author": "Tbone1178",
            "created_utc": 1525743524,
            "selftext": "Finals and Exams coming up, and I'm weighed down with stress. What's a good way to relieve stress without losing any precious study time?"
        },
        {
            "author": "bookDJnr11",
            "created_utc": 1526333391,
            "selftext": "I have been feeling stressed and generally depressed for about a year, resently I've been having random spurts of anger followed by stress. Due to this my anxiety and stress have been getting worse and I have even started to cut my self, I have told my parents this but now I feel bad and guilty about laing some stress onto them which has made me fell worse, they haven't told anyone else about this because they think they are going to lock me up in some padded cell, now my outburst are getting worse and I've beginning to lose weight due to the stress and I don't know what to do to help me or them. Help."
        },
        {
            "author": "SWiltord11",
            "created_utc": 1525617632,
            "selftext": "Female, 32, 5'8 and 60kg, currently taking the pill, non-smoker. \n\nMy blood pressure is very low and causing symptoms of dizziness and one faintinh incident. This has been going on for 5 months.\n\nMy other symptoms include:\nDeveloped generalised anxiety disorder in this time and panic disorder. \nFeel dehydrated 24/7 but drink loads of water.\nWater goes straight through me and is usually clear, I often get up twice each night to go to the toilet.\nGeneral feelings of illness: fatigue, weaker muscles, lack of energy.\n\nMy blood tests show sodium is mildly high and potassium is low  (I have a very healthy diet that includes very little salt and foods very high in potassium. This seems unusual to me as these are normally related to high bp. \n\nI also have an abnormal ecg (inverted t waves) but my heart has been checked. Also ruled out POTS. \n\nI tried florinef to raise blood pressure but did nothing other than give me elevated cortisol.\n\nAny ideas? Every time I have a lead it says I should have high bp! I think something is causing lack of water retention which has caused the rest... But the doctor is stumped and I'm really struggling. \n\n\n"
        },
        {
            "author": "Jpetaia",
            "created_utc": 1525233788,
            "selftext": "Tonight I will be having my last cigarette, (conveniently the last one in the pack). Ever have an event that cause you to just being in your head? Well it ya caused me to be very reflective today in a big way. Decided that there are going to be changes happening. And I’m creating a new me. A more healthier and stronger, (mentally, emotionally, and physically) version of myself. And it starts with quitting smoking cigarettes and pot, as well as drinking alcohol and eating unhealthy.\n\nThis year will mark 10 years that I have been a been smoker. Started off socially, thinking to myself “I’m not addicted, I can quit whenever,  and of course; progressed from there. I have thought tonight about why I need them! My typical smoker response? “It helps relieve my stress”. I finally realized tonight that, yeah maybe while I’m smoking it and for a few minutes after, my stress might be relieved. Guess what though, it comes back. Then what? We all know the answer to that. My solution? Just deal with the stress. Figure out why you’re stressed out and come up with a way to eliminating it permanently.  We don’t need them. They aren’t helping us, only harming.\n\nI’ll probably post a lot in here, as way to use up my new free time. \n\nAnyways, thanks for giving me a little listen. Felt good to get that out and don’t have anyone to talk to, so thanks for being a supportive audience to me and each other. "
        },
        {
            "author": "[deleted]",
            "created_utc": 1527366326,
            "selftext": "Stress is my main issue. Things like video games, writing, YouTube and porn have no helped so far. Does anyone know other ways to relieve stress?"
        }
    ]
}